#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(1000);//休眠1000ms
//	}
//	return 0;
//}
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	//arr[i]-->	char	-128~127
//	//-1 -2 ... -128 127 126 .. 3  2 1 0
//	//128+127=255
//	printf("%d", strlen(a));//255
//	return 0;
//}
//unsigned char i = 0;//0~255
#include<string.h>
//int main()
//{/*
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}*/
//	//size_t - > unsigned int 
//	//
//	if (strlen("abc") - strlen("abcdef") >= 0)
//		printf(">\n");
//	else
//		printf("<\n");
//	return 0;
//}
// 
//浮点数存储规则
//任意一个二进制浮点数可表示成V=(-1)^S * M * 2^E
//(-1)^S表示符号位  M表示有效数字，大于等于1，小于2  2^E表示指数位
//IEEE 754规定 对于32位的浮点数，最高的1位是符号位S，接着的8位是指数位E，剩下的23位为有效数字M
// 对于64位的浮点数，最高的1位是符号位S，接着的11位是指数位E，剩下的52位为有效数字M
//E=-1时 float -> E(真实值)+127(中间值) -> 126 - 存储
//      double -> E(真实值)+1023(中间值) -> 1022 - 存储
int main()
{
	float f = 5.5;//存储
	//5.5
	//101.1
	//1.011*2^2
	//s=0,m=1.011,e=2 2+127=129
	//0 10000001 01100000000000000000000
	//(-1)^0 * 1.01100000000000000000000 * 2^2 (取出)(E不为全0也不为全1)    129-127
	//0x40 b0 00 00

	int n = 9;
	//00000000000000000000000000001001
	//0 00000000 00000000000000000001001
	//E=-126 M=0.00000000000000000001001
	//+ 0.00000000000000000001001 * 2^(-126)
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);//9
	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
	*pFloat = 9.0;
	//1001.0
	//1.001*2^3
	//S=0 E=3 M=1.001
	//0 10000010 00100000000000000000000
	//
	printf("num的值为：%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);//9.0
	return 0;
}