#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//% 取模操作符的两端必须是整数
//int main()
//{
//	int a = 7 % 2;
//	int b = 7 / 2;
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}
//移位操作符，移动的是二进制位(不支持浮点数)
//整数的二进制表示有3种 原码 反码 补码 
//正整数的原码、反码、补码相同
//负整数的要计算
//7
//0000000000000000000000000000111-原码
//0000000000000000000000000000111-反码
//0000000000000000000000000000111-补码
//-7
//1000000000000000000000000000111-原码
//1111111111111111111111111111000-反码（原码的符号位不变，其他位按位取反）
//1111111111111111111111111111001-补码（反码+1）
//整数在内存中存储的是补码
//int main()
//{
//	int a = 7;
//	//左移操作符
//	int b = a << 1;
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}
//右移操作符
//1.算术移位  右边丢弃，左边补原符号位
//2.逻辑移位  右边丢弃，左边补0
//int main()
//{
//	int a = -7;
//	int b = a >> 1;
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}

//位操作符（二进制位）
//&  按位与
//|  按位或
//^  按位异或(相同为0，相异为1)
//int main()
//{
	/*int a = 3;
	int b = -5;
	int c = a & b;
	printf("c=%d\n", c);*/
	//00000000000000000000000000000011---3的补码
	//10000000000000000000000000000101
	//11111111111111111111111111111010
	//11111111111111111111111111111011---5的补码
	//00000000000000000000000000000011---3的补码
	//00000000000000000000000000000011
	//int a = 3;
	//int b = -5;
	//int c = a | b;
	//printf("c=%d\n", c);//-5
//	int a = 3;
//	int b = -5;
//	int c = a ^ b;
//	printf("c=%d\n", c);//-8
//	return 0;
//}

//不能创建临时变量，实现两个数的交换
//0^a=a  a^a=0
//
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前：a=%d,b=%d\n", a, b);
//	a = a ^ b;//3^5
//	b = a ^ b;//3^5^5-->b=3
//	a = a ^ b;//3^5^3-->a=5
//	printf("交换后：a=%d,b=%d\n", a, b);
//	return 0;
//}

//求一个整数存储在内存中二进制中1的个数
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int i = 0;
//	int count = 0;
//	for (i = 1; i < 32; i++)
//	{
//		if (n & 1)
//		{
//			count++;
//		}
//		n=n >> 1;
//	}
//	printf("%d", count);
//	return 0;
//}
//单目操作符
//C语言中0表示假，非0表示真
int main()
{
	//int flag = 3;
	////flag为真,进入if
	//if (flag)
	//{ }
	////flag为假,进入if
	//if (!flag)
	//{ }
	//int a = 10;
	//int n = sizeof(a);//计算的是a所占内存的大小，单位是字节
	//printf("n=%d\n", n);
	//printf("%p\n", &a);
	//int* p = &a;//p就是指针变量
	return 0;
}