#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//第一个void 表示函数不会返回值
//第二个void 表示函数不需要传任何参数
//void test(void)
//{
//	printf("hehe\n");
//}
//int main()
//{
//	//sizeof(long)>=sizeof(int)
//	//字符的本质是ASCII码值，是整型，所以划分到整型家族
//	//char到底是signed char还是unsigned char标准是未定义的，取决于编译器的实现
//	test();
//	return 0;
//}
//整型在内存中的存储
//整数内存中存放的是补码的二进制序列
//补码与原码相互转换，其运算过程相同，都是取反+1
//0x11223344  
//11223344 
//大端字节序存储：把一个数据的高位字节序的内容存放在低地址处，把低位字节序的内容放在高地址处
//44332211
//小端字节序存储：把一个数据的高位字节序的内容存放在高地址处，把低位字节序的内容放在低地址处
//判断计算机大小端存储方式
//int check_sys()
//{
//	int a=1;
//	return *(char*)&a;
//}
//int main()
//{
//	/*int a = 10;
//	int b = -10;*/
//	/*int a = 1;*/
//	/*if (*(char*)&a == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}*/
//	int ret = check_sys();
//	if (ret == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}
//int main()
//{
//	//有符号char -128~127
//	//无符号char 0~255	
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111 - 补码
//	//截断 11111111 - a
//	//%d是打印有符号的整型
//	//整型提升
//	//11111111111111111111111111111111 - 内存中的补码
//	//10000000000000000000000000000000
//	//10000000000000000000000000000001 - 原码 打印-1
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111 - 补码
//	//11111111 - c  无符号数高位补0
//	//00000000000000000000000011111111 - 补码  255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000
//	//10000000
//	//11111111111111111111111110000000 
//	printf("%u\n", a);
//	printf("%d\n", a);//-128
//	return 0;
//}
int main()
{
	//char a = 128;
	//printf("%u\n", a);
	//printf("%d\n", a);//-128
	int i = -20;

	unsigned int j = 10;
	//10000000000000000000000000010100 - -20
	//11111111111111111111111111101011
	//11111111111111111111111111101100 - -20 补码
	//00000000000000000000000000001010 -  10补码
	//11111111111111111111111111110110 - 补码
	//10000000000000000000000000001001
	//10000000000000000000000000001010 - -10
	printf("%d\n", i + j);//-10
	return 0;
}